{
    "heading":"How To Officially Break Up With Amazon Prime (It's Hard, We Know!)",
    "image": "pexels-daria-shevtsova-1070053.jpg",
    "content": "Ding—ding—ding—ding. Within the span of four minutes, I have text messages from four different people wanting to catch up. Tears strike hot in the inner corners of my eyes, and I take a screenshot, as if I need a receipt for the overwhelm. Lately, my inbox is punctuated with unread messages, aggressive email marketing, endless video and song recommendations, and invitations from friends to get together. At places. In public. Los Angeles is slowly beginning to reopen—though I know it’s not this way everywhere in the world. Those “open” signs flash before me like every notification that blinks on my phone, and, at least to me, they’re almost equally as unwelcome. Everything seems to be calling my name, trying to cop a portion of my depleted attention. My optometrist, my long-distance friends, the dusty and full dry cleaning bag that’s tucked under my bed. (What’s even in there?) There’s a particular pain in knowing that I’ve put off being scolded by my dentist for far too long. The things I must do and the things that I want to do mix into bitter medicine. I know it’ll be good for me—to see my friends (and to get my teeth cleaned)—but the shock of it feels too much to handle. A spoonful of sugar will not, in fact, help the medicine of re-entry go down. “Because if I made it through the past year, shouldn’t I make up for that lost time and dive boldly back in?” But I can’t just stay at home, right? I owe it to the open world to participate in the same way as I did before, maybe more so, I think. Because if I made it through the past year, shouldn’t I make up for that lost time and dive boldly back in? Instead, I find myself clinging to my stay-at-home routine; from where I stand, there’s only exhaustion in a full-force return to life as “normal.” Before the stay-at-home orders, I tried to bring my whole self everywhere I went—little breadcrumbs for my future self to ground me on my return. It was a way to say I’ve been here, and there’s comfort for me here. I allocated scraps of my attention to the restaurants I loved, extended my mind across state lines where I’d check in with friends and family. I even gave a compartment of my brain to my commute. I fed my routines like a sourdough starter, before I even had one. When I finally took the required pause, I realized how scattered I’d become. So I began the process of collecting myself. The yoga studio, the now-closed brewery, the office—all those versions of me finally coalesced into a pair of sweatpants on my couch, forming a whole and rested person. I found new hobbies, discovered a steady social rhythm, mourned losses, and spent (maybe too many) hours exploring my own internal world. It’s time to return myself, bit by bit, to the places I once frequented. I know that I can’t stay at home forever. I need to reconnect with others, and my heart aches to be seen by them—but there is going to be discomfort and dismantling in the process. Because now the world wants me back; you want me back. “I need to reconnect with others—but there is going to be discomfort and dismantling in the process.” So to everyone who wants to see me: I love you all, I really do. (Except for you, dentist.) But I just can’t burst back into the world, not now, not all at once. My love for you has not diminished; these pandemic-weary eyes need some time to adjust back to the brightness of everything around me. I’ve been happy to be alone for long stretches of time, yet now I see I’ve tunneled myself so deeply that the light of socializing is only a tiny, terrifying pinprick in the distance. And here you are, my social butterfly, wanting to flip on the light switch and illuminate the whole tunnel. For those of you who I can embrace seamlessly, as if no time at all has passed since we last spoke, you’re the MVPs. You warmed my way through this frigid year, whether we spoke often or not at all. And for some, my baby steps might be too slow. I see that, too; we all need different things right now. Maybe that means I’m not the friend you need at this moment, and I’ll treasure our friendship while grieving its slow fading away. For the rest, please be patient with me. If you notice that I’m canceling, don’t offer up a dozen alternative times and places and plans. If you notice I’m being flaky, don’t assume I hate you—check in on me. I’ll tell you the truth. In return, you have my heart. When I’m ready and able, I will brave the LA traffic and the breakfast crowds and talk to you long after our coffee has gone cold. I will ask you about how you, as a person, are doing, and I will listen. Deeply. I will hold you in love, whether we’re in touch or not. Whether we’re ready to touch and hold each other again, or not.",
    "category": "self"
}
